{
    "Q1": "Staff are good at explaning things",
    "Q2": "Staff often make the subject engaging",
    "Q3": "The course is often intellectually stimulating",
    "Q4": "The course often challenges me to achieve my best work",
    "Q5": "Positive about the chances to explore ideas and concepts in depth",
    "Q6": "The course introduces subjects and skills well in a way that builds on what I have already learned",
    "Q7": "Positive about the chances to bring together information and ideas from different topics",
    "Q8": "The course has the right balance of directed and independent study",
    "Q9": "The course has developed the knowledge and skills I think I will need for my future.",
    "Q10": "The criteria used in marking and assessing my work have been clear.",
    "Q11": "The marking and assessment of my course has been fair",
    "Q12": "Assessments have allowed me to demonstrate what I have learned",
    "Q13": "Assessment feedback has been received on time",
    "Q14": "Feedback has often helped me improve my work",
    "Q15": "It was easy to contact teaching staff when I needed to",
    "Q16": "Teaching staff have supported my learning well",
    "Q17": "My course is well organised",
    "Q18": "Changes to teaching on my course have been well communicated.",
    "Q19": "The IT resources and facilities provided have supported my learning well.",
    "Q20": "The library resources (e.g. books, online services and learning spaces) have supported my learning well.",
    "Q21": "It has been easy to access subject-specific resources (e.g. equipment, facilities, software, collections) when I needed to.",
    "Q22": "I have had the right opportunities to provide feedback on my course.",
    "Q23": "Staff value students’ views and opinions about the course.",
    "Q24": "It is clear that students' feedback on the course is acted on.",
    "Q25": "The students' union (association or guild) represents students' academic interest well.",
    "Q26": "Information about mental wellbeing support services has been well communicated",
    "Q27": "I have felt free to express my ideas, opinions and beliefs",
    "Q28": "Overall, I am satisfied with the quality of the course"
}
